Importing relevant Packages

In [1]:
# Importing the relevant packages
import numpy as np
import pandas as pd
from pandas import DataFrame
import seaborn as sns

In [2]:
#Reading the CSV file and specifying the delimiter
df = pd.read_csv(r"2022 Sixt - Commercial Analytics Recruiting Task.csv", header = 0, delimiter=';')

In [3]:
#Checking to see if the CSV was read correctly
df.head()

,Client,FirstAction,LastAction,Date,Time,UserID,UserAction,ArtNr,ArtName,Place,Price,ActionInfo1,CompareArtNr,ComparePlace,ShopType
0,ws014855,14:44:59,14:45:15,16.09.2014,14:45:15,User94295555912ID99912263546,liftup,598886.0,Rolex GMT-Master II,2,9735.0,NaN,NaN,NaN,C
1,ws014855,17:20:48,17:20:59,25.09.2014,17:20:59,User91580650629ID43569660373,starttut_auto,574296.0,Maurice Lacroix Retrogrades,1,5985.0,NaN,NaN,NaN,C
2,ws014855,15:38:00,15:39:01,11.09.2014,15:38:13,User14958227612ID93909495044,starttut_auto,558355.0,Rol Die Sea-Dweller 4000,5,6435.0,NaN,NaN,NaN,C
3,ws014855,16:19:01,16:19:01,22.09.2014,16:19:01,User46918181749ID43074807525,liftup,596579.0,Breitling Chronomat B13350,13,5985.0,NaN,NaN,NaN,C
4,ws014855,13:07:30,13:07:56,29.09.2014,13:07:52,User18960750848ID74810983101,liftup,572848.0,Rolex Die Dweller 3500 CH,7,5235.0,NaN,NaN,NaN,C

In [4]:
#Creating proper date time columns out of date and times
df['FirstAction'] = pd.to_datetime(df['Date']+ ' ' + df['FirstAction'], utc=True)
df['LastAction'] = pd.to_datetime(df['Date']+ ' ' + df['LastAction'], utc=True)
df['Time'] =  pd.to_datetime(df['Date']+ ' ' + df['Time'], utc=True)
#Generating day of the week for each date
df['Date'] =  pd.to_datetime(df['Date'], utc=True)
df['Week_Day'] = df['Date'].apply(lambda x:x.day_name())

C:\Users\hassa\AppData\Local\Temp\ipykernel_20000\3367491071.py:6: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  df['Date'] =  pd.to_datetime(df['Date'], utc=True)

In [5]:
#Checking the size of our table
df.shape
#We have 182703 rows and 15 columns
#The dimensions are: Client, UserID, UserAction, ArtNr., ArtName and ShopType

(182703, 16)

In [6]:
#Dropping completely empty rows and checking new size
df.dropna(how='all', inplace=True)
df.shape
#No row was completely empty|

(182703, 16)

In [7]:
#Checking for duplicated rows
df[df.duplicated()]
#No duplicates were found

Empty DataFrame
Columns: [Client, FirstAction, LastAction, Date, Time, UserID, UserAction, ArtNr, ArtName, Place, Price, ActionInfo1, CompareArtNr, ComparePlace, ShopType, Week_Day]
Index: []

In [8]:
#Checking data types
df.dtypes

Client                       object
FirstAction     datetime64[ns, UTC]
LastAction      datetime64[ns, UTC]
Date            datetime64[ns, UTC]
Time            datetime64[ns, UTC]
UserID                       object
UserAction                   object
ArtNr                       float64
ArtName                      object
Place                         int64
Price                       float64
ActionInfo1                  object
CompareArtNr                float64
ComparePlace                float64
ShopType                     object
Week_Day                     object
dtype: object

In [9]:
#Checking ratio of null values per column
df.isna().sum()#*100/182703
#8 rows have no proper product attributed
#A significant portion of the rows lack ActionInfo1 as well as Comparison entries which is to be expected

Client               0
FirstAction          0
LastAction           0
Date                 0
Time                 0
UserID               0
UserAction           0
ArtNr                8
ArtName              8
Place                0
Price                8
ActionInfo1     158127
CompareArtNr    171705
ComparePlace    171705
ShopType          3575
Week_Day             0
dtype: int64

In [10]:
#Checking the latter rows
df[df['ArtNr'].isna() | df['ArtName'].isna() | df['Price'].isna()]

,Client,FirstAction,LastAction,Date,Time,UserID,UserAction,ArtNr,ArtName,Place,Price,ActionInfo1,CompareArtNr,ComparePlace,ShopType,Week_Day
75361,ws353255,2014-04-09 08:44:53+00:00,2014-04-09 08:44:53+00:00,2014-04-09 00:00:00+00:00,2014-04-09 08:44:53+00:00,User62087908620ID46061420953,starttut_auto,NaN,NaN,27,NaN,NaN,NaN,NaN,B,Wednesday
75963,ws353255,2014-04-09 07:39:41+00:00,2014-04-09 07:39:41+00:00,2014-04-09 00:00:00+00:00,2014-04-09 07:39:41+00:00,User68292314792ID34609491984,starttut_auto,NaN,NaN,24,NaN,NaN,NaN,NaN,B,Wednesday
76073,ws353255,2014-04-09 08:34:14+00:00,2014-04-09 08:34:49+00:00,2014-04-09 00:00:00+00:00,2014-04-09 08:34:14+00:00,User90659896750ID30202770280,starttut_auto,NaN,NaN,24,NaN,NaN,NaN,NaN,B,Wednesday
76468,ws353255,2014-04-09 08:24:25+00:00,2014-04-09 08:24:36+00:00,2014-04-09 00:00:00+00:00,2014-04-09 08:24:25+00:00,User47980124829ID20587094454,starttut_auto,NaN,NaN,24,NaN,NaN,NaN,NaN,B,Wednesday
76660,ws353255,2014-04-09 08:34:14+00:00,2014-04-09 08:34:49+00:00,2014-04-09 00:00:00+00:00,2014-04-09 08:34:49+00:00,User90659896750ID30202770280,compare,NaN,NaN,24,NaN,Maurice lacroix Masterpiece Double,593879.0,6.0,B,Wednesday
76794,ws353255,2014-04-09 08:24:25+00:00,2014-04-09 08:24:36+00:00,2014-04-09 00:00:00+00:00,2014-04-09 08:24:36+00:00,User47980124829ID20587094454,compare,NaN,NaN,24,NaN,Rol Die Sea-Dweller 4000,558355.0,5.0,B,Wednesday
89975,WS519355,2014-09-30 13:24:03+00:00,2014-09-30 13:24:33+00:00,2014-09-30 00:00:00+00:00,2014-09-30 13:24:03+00:00,User2103754879ID34312048275,language,NaN,NaN,7,NaN,IT,NaN,NaN,D,Tuesday
105689,ws602455,2014-05-09 07:46:36+00:00,2014-05-09 07:46:51+00:00,2014-05-09 00:00:00+00:00,2014-05-09 07:46:36+00:00,User17529480858ID39090959169,language,NaN,NaN,5,NaN,FR,NaN,NaN,B,Friday

In [11]:
#Dropping entries with no ArtNr
df = df[df['ArtNr'].isna() == False]
df.shape
#8 entries were succesfully deleted

(182695, 16)

In [12]:
#Casting into the appropriate data types
dtypes = {
    'Client' : 'str',
    'UserID' : 'str',
    'UserAction' : 'str',
    'ArtNr' : 'int64',
    'ArtName' : 'str',
    'Place' : 'int64',
    'Price' : 'float',
    'ShopType' : 'str'
}

df = df.astype(dtypes)

In [13]:
#Checking the number of unique values in each column
df.nunique()
#Despite having only 21 Places we obtain 23
#We have 53327 different users
#8 actions
#6 different Shopt types

Client              89
FirstAction      51909
LastAction       51811
Date                30
Time            166346
UserID           53327
UserAction           8
ArtNr               22
ArtName             22
Place               23
Price               12
ActionInfo1         43
CompareArtNr        22
ComparePlace        21
ShopType             7
Week_Day             7
dtype: int64

In [14]:
dft = df.groupby(['ActionInfo1'], as_index=False)['ActionInfo1']\
        .count()\
        .reset_index(name = 'count')\
        .sort_values(['count'], ascending = True)
dft

                           ActionInfo1  count
16                        Finance SE-S     18
9                      Finance Ge-D-24     26
6                        Finance Ge-60     30
17                      Finance SE-con     56
10                     Finance Ge-F-12     57
8                      Finance Ge-D-12     66
11                     Finance Ge-F-24     76
21                                  IT     92
4                                   EN    102
5                                   FR    117
7                         Finance Ge-D    133
3                                   DE    163
32              Rolex Die Dweller 3500    168
23         Maurice Lacroix Retrogrades    241
29                    Rol Cillini 4233    263
2                Breitling World 80840    305
19                     Finance SE-tout    309
28                Panerai Luminor Dial    321
22  Maurice Lacroix Master Automatique    322
0           Breitling Chronomat B13350    347
1              Breitling Chronomat GMT    386
24              Maurice Les Classiques    430
33           Rolex Die Dweller 3500 CH    446
34                      Rolex Explorer    458
27                        Omega Tresor    471
38                 Tag Heuer Aquaracer    477
36                    Rolex Submariner    494
20               Hublot Classic Fusion    512
12                     Finance Ge-Full    531
31                        Rolex D-Blue    532
26  Maurice lacroix Masterpiece Double    539
37                       Rolex Vintage    541
25     Maurice Micros Automatic 200 mt    563
18                    Finance SE-start    595
40                               close    627
13                     Finance M-Basic    659
41                                hide    669
35                 Rolex GMT-Master II    834
14                        Finance MS-B    840
30            Rol Die Sea-Dweller 4000    892
15                        Finance MS-D    967
39                   Tag Heuer Carrera   1454
42                                show   7443

In [15]:
#Checking the distribution of row count by Place entry
dft = df.groupby(['Place'], as_index=False)['Place']\
        .count()\
        .reset_index(name = 'count')\
        .sort_values(['count'], ascending = True)
dft
#Places 27 and 24 have 1 value each and will be dropped for simplicity as they are data entry errors

    Place  count
22     27      1
21     24      1
10     11   5282
0       1   5709
13     14   5737
18     19   6299
9      10   6302
12     13   6950
15     16   6968
7       8   7236
19     20   7706
14     15   7928
11     12   7984
17     18   8106
8       9   8186
2       3   8451
3       4   8836
20     21  10395
16     17  10449
6       7  10632
5       6  12239
4       5  14891
1       2  16407

In [16]:
#Dropping the two rows with questionable Place entry
df = df[df['Place'].isin([24,27]) == False]
df.shape
#2 Rows succesfully dropped

(182693, 16)

In [17]:
#Checking for similar data errors in client names since we have 89 and it might be that some of these entries are not warranted
#We will group by client, and count the number of rows we get to get a hint
dft = df.groupby(['Client'], as_index=False)['Client']\
        .count()\
        .reset_index(name = 'count')\
        .sort_values(['count'], ascending = True)
dft
#We notice that sometimes client names would contain uppercase characters and sometimes lower case. Perhaps cleaning the string can help

      Client  count
58  ws726855    517
0   WS115455    529
57  ws725555    530
61  ws801355    742
9   ws017155    758
..       ...    ...
11  ws114655   4327
7   WS860355   4543
26  ws278055   4577
75  ws857155   5692
14  ws117855   8210

[89 rows x 2 columns]

In [18]:
#creating a table with cleaner string entries by making everything lower case and stripping extra white spaces
dfc= df.applymap(lambda s:s.lower().strip() if type(s) == str else s)

In [19]:
#Trying new distribution of values amongst client entries
dft = dfc.groupby(['Client'], as_index=False)['Client']\
        .count()\
        .reset_index(name = 'count')\
        .sort_values(['count'], ascending = True)
dft
#There actually are 89 different Clients

      Client  count
57  ws726855    517
4   ws115455    529
56  ws725555    530
60  ws801355    742
1   ws017155    758
..       ...    ...
3   ws114655   4327
75  ws860355   4543
19  ws278055   4577
74  ws857155   5692
7   ws117855   8210

[89 rows x 2 columns]

In [50]:
#Checking if clients have a consistent ShopType classificaitons
#Grouping by Client and ShopType
#If we get the same count of Clients we are fine
dft = dfc.groupby(['Client','ShopType'], as_index=False)['Client','ShopType'].count()
dft
#We got 3 less Clients which means there might be some clients who miss a classification

C:\Users\hassa\AppData\Local\Temp\ipykernel_20000\2617338190.py:4: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  dft = dfc.groupby(['Client','ShopType'], as_index=False)['Client','ShopType'].count()

    Client  ShopType
0     1580      1580
1      758       758
2     1913      1913
3     4327      4327
4      529       529
..     ...       ...
84    1464      1464
85    1567      1567
86    1751      1751
87    1460      1460
88    2016      2016

[89 rows x 2 columns]

In [21]:
#We fetch the list of clients with no shop type
dfc[dfc['ShopType'].isna()]['Client'].unique()

array([], dtype=object)

In [22]:
dfc[['Client']].value_counts(ascending = True).reset_index(name = 'count')

      Client  count
0   ws726855    517
1   ws115455    529
2   ws725555    530
3   ws801355    742
4   ws017155    758
..       ...    ...
84  ws114655   4327
85  ws860355   4543
86  ws278055   4577
87  ws857155   5692
88  ws117855   8210

[89 rows x 2 columns]

In [49]:
#Grouping by watch
dft = df.groupby(['ArtNr','ArtName'], as_index=False)['Price'].count()
dft
#We have 22 differente watches

     ArtNr                             ArtName  Price
0   543700                    Rolex Submariner   8453
1   558355            Rol Die Sea-Dweller 4000  14888
2   572847              Rolex Die Dweller 3500   3134
3   572848           Rolex Die Dweller 3500 CH   7499
4   572849              Maurice Les Classiques   6965
5   574296         Maurice Lacroix Retrogrades   5708
6   577349                       Rolex Vintage  10450
7   579413                    Rol Cillini 4233   6301
8   581108                        Rolex D-Blue  10389
9   585655     Maurice Micros Automatic 200 mt   5286
10  593879  Maurice lacroix Masterpiece Double  12246
11  596579          Breitling Chronomat B13350   6949
12  598044               Hublot Classic Fusion   7706
13  598886                 Rolex GMT-Master II  16407
14  601509                      Rolex Explorer   8831
15  602302                   Tag Heuer Carrera   7928
16  603048                        Omega Tresor   6297
17  603064               Breitling World 80840   5736
18  605658  Maurice Lacroix Master Automatique   8190
19  605712                Panerai Luminor Dial   8109
20  605750                 Tag Heuer Aquaracer   7234
21  605751             Breitling Chronomat GMT   7987

In [24]:
df.head()

,Client,FirstAction,LastAction,Date,Time,UserID,UserAction,ArtNr,ArtName,Place,Price,ActionInfo1,CompareArtNr,ComparePlace,ShopType,Week_Day
0,ws014855,2014-09-16 14:44:59+00:00,2014-09-16 14:45:15+00:00,2014-09-16 00:00:00+00:00,2014-09-16 14:45:15+00:00,User94295555912ID99912263546,liftup,598886,Rolex GMT-Master II,2,9735.0,NaN,NaN,NaN,C,Tuesday
1,ws014855,2014-09-25 17:20:48+00:00,2014-09-25 17:20:59+00:00,2014-09-25 00:00:00+00:00,2014-09-25 17:20:59+00:00,User91580650629ID43569660373,starttut_auto,574296,Maurice Lacroix Retrogrades,1,5985.0,NaN,NaN,NaN,C,Thursday
2,ws014855,2014-11-09 15:38:00+00:00,2014-11-09 15:39:01+00:00,2014-11-09 00:00:00+00:00,2014-11-09 15:38:13+00:00,User14958227612ID93909495044,starttut_auto,558355,Rol Die Sea-Dweller 4000,5,6435.0,NaN,NaN,NaN,C,Sunday
3,ws014855,2014-09-22 16:19:01+00:00,2014-09-22 16:19:01+00:00,2014-09-22 00:00:00+00:00,2014-09-22 16:19:01+00:00,User46918181749ID43074807525,liftup,596579,Breitling Chronomat B13350,13,5985.0,NaN,NaN,NaN,C,Monday
4,ws014855,2014-09-29 13:07:30+00:00,2014-09-29 13:07:56+00:00,2014-09-29 00:00:00+00:00,2014-09-29 13:07:52+00:00,User18960750848ID74810983101,liftup,572848,Rolex Die Dweller 3500 CH,7,5235.0,NaN,NaN,NaN,C,Monday

In [29]:
#Generating column and row numbers for each of the 21 positions
row = lambda x: (x-1)//7 + 1 #This will generate the row of any place
column = lambda x: (x-1)%7 + 1 #This will generate the column of any place
df['row'] = df['Place'].apply(row)
df['column'] = df['Place'].apply(column)

In [38]:
df.head()

,Client,FirstAction,LastAction,Date,Time,UserID,UserAction,ArtNr,ArtName,Place,Price,ActionInfo1,CompareArtNr,ComparePlace,ShopType,Week_Day,row,column
0,ws014855,2014-09-16 14:44:59+00:00,2014-09-16 14:45:15+00:00,2014-09-16 00:00:00+00:00,2014-09-16 14:45:15+00:00,User94295555912ID99912263546,liftup,598886,Rolex GMT-Master II,2,9735.0,NaN,NaN,NaN,C,Tuesday,1,2
1,ws014855,2014-09-25 17:20:48+00:00,2014-09-25 17:20:59+00:00,2014-09-25 00:00:00+00:00,2014-09-25 17:20:59+00:00,User91580650629ID43569660373,starttut_auto,574296,Maurice Lacroix Retrogrades,1,5985.0,NaN,NaN,NaN,C,Thursday,1,1
2,ws014855,2014-11-09 15:38:00+00:00,2014-11-09 15:39:01+00:00,2014-11-09 00:00:00+00:00,2014-11-09 15:38:13+00:00,User14958227612ID93909495044,starttut_auto,558355,Rol Die Sea-Dweller 4000,5,6435.0,NaN,NaN,NaN,C,Sunday,1,5
3,ws014855,2014-09-22 16:19:01+00:00,2014-09-22 16:19:01+00:00,2014-09-22 00:00:00+00:00,2014-09-22 16:19:01+00:00,User46918181749ID43074807525,liftup,596579,Breitling Chronomat B13350,13,5985.0,NaN,NaN,NaN,C,Monday,2,6
4,ws014855,2014-09-29 13:07:30+00:00,2014-09-29 13:07:56+00:00,2014-09-29 00:00:00+00:00,2014-09-29 13:07:52+00:00,User18960750848ID74810983101,liftup,572848,Rolex Die Dweller 3500 CH,7,5235.0,NaN,NaN,NaN,C,Monday,1,7

In [31]:
#Authenticating with big query to export data
from google.cloud import bigquery
from google.oauth2 import service_account
credentials = service_account.Credentials.from_service_account_file(
'voltaic-layout-337816-3cc3149144a2.json')
project_id = 'my-bq'
client = bigquery.Client(credentials= credentials,project=project_id)

In [32]:
df.to_gbq('random.sixt_data_raw', 
                 'voltaic-layout-337816',
                 chunksize=None, # I have tried with several chunk sizes, it runs faster when it's one big chunk (at least for me)
                 if_exists='replace',
                 )